cfd/c172/openfoam/case/system/blockMeshDict_bak_v2_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cv_x_min -20.0;
cv_x_max  60.0;
cv_y_min -15.0;
cv_y_max  15.0;
cv_z_min -15.0;
cv_z_max  15.0;

s2_x_min  -5.0;
s2_x_max  15.0;

convertToMeters 1.0;

vertices
(
    ( $cv_x_min $cv_y_min $cv_z_min )
    ( $s2_x_min $cv_y_min $cv_z_min )
    ( $s2_x_max $cv_y_min $cv_z_min )
    ( $cv_x_max $cv_y_min $cv_z_min )
    ( $cv_x_min $cv_y_max $cv_z_min )
    ( $s2_x_min $cv_y_max $cv_z_min )
    ( $s2_x_max $cv_y_max $cv_z_min )
    ( $cv_x_max $cv_y_max $cv_z_min )
    ( $cv_x_min $cv_y_min $cv_z_max )
    ( $s2_x_min $cv_y_min $cv_z_max )
    ( $s2_x_max $cv_y_min $cv_z_max )
    ( $cv_x_max $cv_y_min $cv_z_max )
    ( $cv_x_min $cv_y_max $cv_z_max )
    ( $s2_x_min $cv_y_max $cv_z_max )
    ( $s2_x_max $cv_y_max $cv_z_max )
    ( $cv_x_max $cv_y_max $cv_z_max )
);

blocks
(
    hex ( 0  1  5  4  8  9 13 12 ) ( 15 30 30 ) simpleGrading ( 0.5 1.0 1.0 )
    hex ( 1  2  6  5  9 10 14 13 ) ( 30 30 30 ) simpleGrading ( 1.0 1.0 1.0 )
    hex ( 2  3  7  6 10 11 15 14 ) ( 45 30 30 ) simpleGrading ( 2.0 1.0 1.0 )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 8 12 4 )
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            ( 3 7 15 11 )
        );
    }
    
    walls
    {
        type patch;
        faces
        (
            // left
            (  0  1  9  8 )
            (  1  2 10  9 )
            (  2  3 11 10 )
            
            // right
            (  4 12 13  5 )
            (  5 13 14  6 )
            (  6 14 15  7 )
            
            // bottom
            (  0  4  5  1 )
            (  1  5  6  2 )
            (  2  6  7  3 )
            
            // top
            (  8  9 13 12 )
            (  9 10 14 13 )
            ( 10 11 15 14 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
